In [1]:
from utils import hql_to_df
import settings
import pandas as pd
import datetime
settings.set_env('sanguo_ks')

In [2]:
info_sql = '''
select ds, user_id, act_time, reg_time
from raw_info
where ds >= '20160530' and ds <= '20160602'
'''
info_df = hql_to_df(info_sql)
info_df.head()

         ds     user_id             act_time             reg_time
0  20160531   m22592631  2016-05-31 22:28:46  2016-04-19 22:24:14
1  20160531   m48785522  2016-05-31 12:14:29  2016-04-20 21:53:24
2  20160531   m18328365  2016-05-31 12:16:08  2016-04-24 20:36:24
3  20160531  m419445322  2016-05-31 20:36:35  2016-05-31 20:36:34
4  20160531  m240843541  2016-06-01 00:10:04  2016-05-11 17:36:53

In [3]:
# 将字符串转化为 datetime 格式
info_df['act_dt'] = pd.to_datetime(info_df.act_time)
info_df['reg_dt'] = pd.to_datetime(info_df.reg_time)
info_df.head()

,ds,user_id,act_time,reg_time,act_dt,reg_dt
0,20160531,m22592631,2016-05-31 22:28:46,2016-04-19 22:24:14,2016-05-31 22:28:46,2016-04-19 22:24:14
1,20160531,m48785522,2016-05-31 12:14:29,2016-04-20 21:53:24,2016-05-31 12:14:29,2016-04-20 21:53:24
2,20160531,m18328365,2016-05-31 12:16:08,2016-04-24 20:36:24,2016-05-31 12:16:08,2016-04-24 20:36:24
3,20160531,m419445322,2016-05-31 20:36:35,2016-05-31 20:36:34,2016-05-31 20:36:35,2016-05-31 20:36:34
4,20160531,m240843541,2016-06-01 00:10:04,2016-05-11 17:36:53,2016-06-01 00:10:04,2016-05-11 17:36:53

In [4]:
# 从注册到最后活跃的时间差
s = info_df.act_dt - info_df.reg_dt
s.head()

0   42 days 00:04:32
1   40 days 14:21:05
2   36 days 15:39:44
3    0 days 00:00:01
4   20 days 06:33:11
dtype: timedelta64[ns]

In [5]:
# 从注册到最后活跃的日期差
s = info_df.act_dt.dt.date - info_df.reg_dt.dt.date
s.head()

0   42 days
1   41 days
2   37 days
3    0 days
4   21 days
dtype: timedelta64[ns]

In [6]:
# 得到int格式的日期差
(info_df.act_dt.dt.date - info_df.reg_dt.dt.date).dt.days.head()

0    42
1    41
2    37
3     0
4    21
dtype: int64

In [7]:
# datetime格式可以直接和字符串格式的日期进行比较
reg_in_jun_df = info_df[info_df.reg_dt >= '20160601']
reg_in_jun_df.head()

,ds,user_id,act_time,reg_time,act_dt,reg_dt
519,20160601,m13314329,2016-06-01 19:06:10,2016-06-01 19:04:04,2016-06-01 19:06:10,2016-06-01 19:04:04
522,20160601,m425289082,2016-06-01 22:59:27,2016-06-01 19:00:16,2016-06-01 22:59:27,2016-06-01 19:00:16
525,20160601,m427885517,2016-06-01 22:49:04,2016-06-01 21:55:40,2016-06-01 22:49:04,2016-06-01 21:55:40
529,20160601,m422594249,2016-06-02 00:18:03,2016-06-01 11:47:17,2016-06-02 00:18:03,2016-06-01 11:47:17
533,20160601,m421932860,2016-06-01 10:12:18,2016-06-01 10:12:18,2016-06-01 10:12:18,2016-06-01 10:12:18

In [8]:
# 字符串格式可以多种多样，会智能解析
reg_in_jun_df = info_df[info_df.reg_dt >= '2016-06-01']
reg_in_jun_df.head()

,ds,user_id,act_time,reg_time,act_dt,reg_dt
519,20160601,m13314329,2016-06-01 19:06:10,2016-06-01 19:04:04,2016-06-01 19:06:10,2016-06-01 19:04:04
522,20160601,m425289082,2016-06-01 22:59:27,2016-06-01 19:00:16,2016-06-01 22:59:27,2016-06-01 19:00:16
525,20160601,m427885517,2016-06-01 22:49:04,2016-06-01 21:55:40,2016-06-01 22:49:04,2016-06-01 21:55:40
529,20160601,m422594249,2016-06-02 00:18:03,2016-06-01 11:47:17,2016-06-02 00:18:03,2016-06-01 11:47:17
533,20160601,m421932860,2016-06-01 10:12:18,2016-06-01 10:12:18,2016-06-01 10:12:18,2016-06-01 10:12:18

In [9]:
# 字符串格式可以多种多样，会智能解析
reg_in_jun_df = info_df[info_df.reg_dt >= '2016/06/01']
reg_in_jun_df.head()

,ds,user_id,act_time,reg_time,act_dt,reg_dt
519,20160601,m13314329,2016-06-01 19:06:10,2016-06-01 19:04:04,2016-06-01 19:06:10,2016-06-01 19:04:04
522,20160601,m425289082,2016-06-01 22:59:27,2016-06-01 19:00:16,2016-06-01 22:59:27,2016-06-01 19:00:16
525,20160601,m427885517,2016-06-01 22:49:04,2016-06-01 21:55:40,2016-06-01 22:49:04,2016-06-01 21:55:40
529,20160601,m422594249,2016-06-02 00:18:03,2016-06-01 11:47:17,2016-06-02 00:18:03,2016-06-01 11:47:17
533,20160601,m421932860,2016-06-01 10:12:18,2016-06-01 10:12:18,2016-06-01 10:12:18,2016-06-01 10:12:18

In [10]:
today = datetime.date.today()
lost_days_df = (today - info_df.act_dt.dt.date).dt.days
lost_days_df.unique()

array([   23,    22,    21, 16975,    24,    20])